emacs/lisp/org.org
#+TITLE: VK's GNU Emacs Config
#+AUTHOR: Vinci XU & Kate Ma (VK)
#+DESCRIPTION: VK's org-mode config.
#+OPTIONS: toc:4

* TABLE OF CONTENTS :toc_4:
- [[#org-mode-setup][ORG MODE SETUP]]
  - [[#work-directory][Work Directory]]
  - [[#toc-org][Toc-org]]
  - [[#org-bullets][Org-bullets]]
  - [[#org-tag-expands-quick][Org Tag Expands Quick]]
  - [[#禁用电子缩进][禁用电子缩进]]
  - [[#diminish-org-indent-mode][Diminish Org Indent Mode]]

* ORG MODE SETUP

** Work Directory

#+begin_src emacs-lisp
(setq org-directory (concat (getenv "HOME") "/Documents/org-notes/"))
#+end_src

** Toc-org

#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Org-bullets
Org-bullets gives us attractive bullets rather than asterisks.

#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets
  :hook (org-mode-hook . (lambda () (org-bullets-mode 1))))
#+end_src

** Org Tag Expands Quick
其他快捷展开示例

| Typing the below + TAB | Expands to ...                          |   |   |   |
|------------------------+-----------------------------------------+---+---+---|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |   |   |   |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |   |   |   |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |   |   |   |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |   |   |   |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |   |   |   |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |   |   |   |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |   |   |   |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |   |   |   |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |   |   |   |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |   |   |   |

#+begin_src emacs-lisp
(use-package org-tempo :elpaca nil)
#+end_src

** 禁用电子缩进
#+begin_src emacs-lisp
;;完全关闭 electric indent 自动缩进功能,防止自动缩进带来的意外问题。
(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)
#+end_src

** Diminish Org Indent Mode
Removes "Ind" from showing in the modeline.

#+begin_src emacs-lisp
(eval-after-load 'org-indent 'org-indent-mode)
(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.7))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.6))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.5))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.4))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.3))))
  '(org-level-6 ((t (:inherit outline-5 :height 1.2))))
  '(org-level-7 ((t (:inherit outline-5 :height 1.1)))))
#+end_src

